Koманда Git:

 1.git init - она создает новый локальный гит репозиторний  у вас на пк в той директории в которой быGIT- распределения система контроля версия Это система для отложивания и вкдкния истории изменения файлов, в вшем проекте.

Репозиторий - хранилище вашего кода и истории его изменениий

Кола прописана комнадаю
 
  2. git add - команда для добвления файлолв в сисему отложения гита, после это комада измнения начинвется!
  4
 !
 5. git push - комаеда для отправки всех ваших изменкниий на локольном репозитории ы удалунный ркерозите в удвлкния репазиторий 
 git puch 
